#### Terraform Format and Style 🖌`success`
#### dev Terraform Initialization ⚙️`success`
#### dev Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### dev Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mdata.terraform_remote_state.shared_services: Refreshing state...[0m
[0m[1mmodule.linux_web_app.module.app_service.random_string.base: Refreshing state... [id=KlPU][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.random_string.base: Refreshing state... [id=yZQ2][0m
[0m[1mmodule.aks_agw_ingress.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.k8s_cluster.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus][0m
[0m[1mmodule.network_spoke.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus][0m
[0m[1mmodule.linux_web_app.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus][0m
[0m[1mmodule.boot_diag_storage.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.user_assigned_identity.azurerm_user_assigned_identity.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourcegroups/rg-aks-dev-eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-aks-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.public_ip.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/publicIPAddresses/pip-agw-dev-eastus][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.azurerm_storage_account.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-dev-eastus/providers/Microsoft.Storage/storageAccounts/stdiagdeyzq2eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network.azurerm_virtual_network.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus][0m
[0m[1mmodule.linux_web_app.module.app_service_plan.azurerm_app_service_plan.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus/providers/Microsoft.Web/serverfarms/asp-linux-dev-eastus][0m
[0m[1mmodule.linux_web_app.module.app_service.azurerm_app_service.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus/providers/Microsoft.Web/sites/app-testklpu-dev-eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network_peering_spoke.azurerm_virtual_network_peering.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/virtualNetworkPeerings/vnet-spoke-dev-eastus-to-vnet-transit-hub-shared-services-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-agw-dev-eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network_peering_hub.azurerm_virtual_network_peering.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/virtualNetworkPeerings/vnet-transit-hub-shared-services-eastus-to-vnet-spoke-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.subnet.azurerm_subnet.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-aks-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.subnet.azurerm_subnet.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-node-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-master-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_0.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/c9eaf8bb-28a1-ac49-25db-3eae7c4daba1][0m
[0m[1mmodule.k8s_cluster.module.lb_k8s_master.azurerm_lb.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.lb_k8s_node.azurerm_lb.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_1.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourcegroups/rg-aks-dev-eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/bbb4bf02-0fc9-a6a9-be2c-3c9aebe020b3][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_3.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/0233663b-e549-8aac-6f4e-73272f925ec0][0m
[0m[1mmodule.aks_agw_ingress.module.application_gateway.azurerm_application_gateway.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/applicationGateways/agw-aks-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_2.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/applicationGateways/agw-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/58f4caeb-3698-f230-3c26-d9594780700a][0m
[0m[1mmodule.k8s_cluster.module.lb_backend_address_pool_k8s_master.azurerm_lb_backend_address_pool.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.k8s_cluster.module.lb_backend_address_pool_k8s_node.azurerm_lb_backend_address_pool.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m
[0m[1mmodule.aks_agw_ingress.data.helm_repository.ingress_azure: Refreshing state...[0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-01-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-00-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-01-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-00-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.aks_agw_ingress.helm_release.ingress_azure[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "helm_release" "ingress_azure" {
      [32m+[0m [0m[1m[0matomic[0m[0m                     = false
      [32m+[0m [0m[1m[0mchart[0m[0m                      = "ingress-azure"
      [32m+[0m [0m[1m[0mcleanup_on_fail[0m[0m            = false
      [32m+[0m [0m[1m[0mdependency_update[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_crd_hooks[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_openapi_validation[0m[0m = false
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m           = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mmax_history[0m[0m                = 0
      [32m+[0m [0m[1m[0mmetadata[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "application-gateway-kubernetes"
      [32m+[0m [0m[1m[0mnamespace[0m[0m                  = "default"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m              = false
      [32m+[0m [0m[1m[0mrender_subchart_notes[0m[0m      = true
      [32m+[0m [0m[1m[0mreplace[0m[0m                    = false
      [32m+[0m [0m[1m[0mrepository[0m[0m                 = "application-gateway-kubernetes-ingress"
      [32m+[0m [0m[1m[0mreset_values[0m[0m               = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m               = false
      [32m+[0m [0m[1m[0mskip_crds[0m[0m                  = false
      [32m+[0m [0m[1m[0mstatus[0m[0m                     = "deployed"
      [32m+[0m [0m[1m[0mtimeout[0m[0m                    = 300
      [32m+[0m [0m[1m[0mvalues[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mverify[0m[0m                     = false
      [32m+[0m [0m[1m[0mversion[0m[0m                    = "1.0.0"
      [32m+[0m [0m[1m[0mwait[0m[0m                       = true
    }

[1m  # module.aks_agw_ingress.null_resource.aks_config[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "null_resource" "aks_config" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)
    }

[1m  # module.aks_agw_ingress.null_resource.aks_test_app[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "null_resource" "aks_test_app" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)
    }

[1m  # module.aks_agw_ingress.module.aks.azurerm_kubernetes_cluster.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_kubernetes_cluster" "base" {
      [32m+[0m [0m[1m[0mdns_prefix[0m[0m              = "nodes"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mkube_admin_config[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mkube_admin_config_raw[0m[0m   = (sensitive value)
      [32m+[0m [0m[1m[0mkube_config[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mkube_config_raw[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mkubelet_identity[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkubernetes_version[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "aks-dev-eastus"
      [32m+[0m [0m[1m[0mnode_resource_group[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mprivate_cluster_enabled[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_fqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_link_enabled[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-aks-dev-eastus"
      [32m+[0m [0m[1m[0msku_tier[0m[0m                = "Free"
      [32m+[0m [0m[1m[0mtags[0m[0m                    = {
          [32m+[0m [0m"terraform_managed" = "true"
        }

      [32m+[0m [0maddon_profile {
          [32m+[0m [0maci_connector_linux {
              [32m+[0m [0m[1m[0menabled[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0msubnet_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mazure_policy {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhttp_application_routing {
              [32m+[0m [0m[1m[0menabled[0m[0m                            = (known after apply)
              [32m+[0m [0m[1m[0mhttp_application_routing_zone_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mkube_dashboard {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0moms_agent {
              [32m+[0m [0m[1m[0menabled[0m[0m                    = (known after apply)
              [32m+[0m [0m[1m[0mlog_analytics_workspace_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moms_agent_identity[0m[0m         = (known after apply)
            }
        }

      [32m+[0m [0mauto_scaler_profile {
          [32m+[0m [0m[1m[0mbalance_similar_node_groups[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mmax_graceful_termination_sec[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_add[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_delete[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_failure[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_unneeded[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_unready[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_utilization_threshold[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mscan_interval[0m[0m                    = (known after apply)
        }

      [32m+[0m [0mdefault_node_pool {
          [32m+[0m [0m[1m[0mmax_pods[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                 = "default"
          [32m+[0m [0m[1m[0mnode_count[0m[0m           = 1
          [32m+[0m [0m[1m[0morchestrator_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mos_disk_size_gb[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                 = {
              [32m+[0m [0m"terraform_managed" = "true"
            }
          [32m+[0m [0m[1m[0mtype[0m[0m                 = "VirtualMachineScaleSets"
          [32m+[0m [0m[1m[0mvm_size[0m[0m              = "Standard_B2s"
          [32m+[0m [0m[1m[0mvnet_subnet_id[0m[0m       = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-aks-dev-eastus"
        }

      [32m+[0m [0mnetwork_profile {
          [32m+[0m [0m[1m[0mdns_service_ip[0m[0m     = "10.1.13.10"
          [32m+[0m [0m[1m[0mdocker_bridge_cidr[0m[0m = "172.17.0.1/16"
          [32m+[0m [0m[1m[0mload_balancer_sku[0m[0m  = "Basic"
          [32m+[0m [0m[1m[0mnetwork_plugin[0m[0m     = "azure"
          [32m+[0m [0m[1m[0mnetwork_policy[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0moutbound_type[0m[0m      = "loadBalancer"
          [32m+[0m [0m[1m[0mpod_cidr[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mservice_cidr[0m[0m       = "10.1.13.0/24"

          [32m+[0m [0mload_balancer_profile {
              [32m+[0m [0m[1m[0meffective_outbound_ips[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mmanaged_outbound_ip_count[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ip_address_ids[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ip_prefix_ids[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ports_allocated[0m[0m  = (known after apply)
            }
        }

      [32m+[0m [0mrole_based_access_control {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)

          [32m+[0m [0mazure_active_directory {
              [32m+[0m [0m[1m[0madmin_group_object_ids[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mclient_app_id[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mmanaged[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mserver_app_id[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mserver_app_secret[0m[0m      = (sensitive value)
              [32m+[0m [0m[1m[0mtenant_id[0m[0m              = (known after apply)
            }
        }

      [32m+[0m [0mservice_principal {
          [32m+[0m [0m[1m[0mclient_id[0m[0m     = "d265b1f3-8015-4031-b076-d83c975f87ed"
          [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
        }

      [32m+[0m [0mwindows_profile {
          [32m+[0m [0m[1m[0madmin_password[0m[0m = (sensitive value)
          [32m+[0m [0m[1m[0madmin_username[0m[0m = (known after apply)
        }
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_master.azurerm_linux_virtual_machine.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m      = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m                   = "k8s-mast-00-deea"
      [32m+[0m [0m[1m[0mdisable_password_authentication[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                        = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m                   = -1
      [32m+[0m [0m[1m[0mname[0m[0m                            = "lvm-k8s-master-00-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = [
          [32m+[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus",
        ]
      [32m+[0m [0m[1m[0mpriority[0m[0m                        = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                            = "Standard_B2s"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                            = "1"

      [32m+[0m [0madmin_ssh_key {
          [32m+[0m [0m[1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
          [32m+[0m [0m[1m[0musername[0m[0m   = "kuhlmanlabs"
        }

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = "https://stdiagdeyzq2eastus.blob.core.windows.net/"
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-lvm-k8s-master-00-dev-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "UbuntuServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "Canonical"
          [32m+[0m [0m[1m[0msku[0m[0m       = "18.04-LTS"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m      = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m                   = "k8s-node-00-deea"
      [32m+[0m [0m[1m[0mdisable_password_authentication[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                        = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m                   = -1
      [32m+[0m [0m[1m[0mname[0m[0m                            = "lvm-k8s-node-00-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = [
          [32m+[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus",
        ]
      [32m+[0m [0m[1m[0mpriority[0m[0m                        = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                            = "Standard_B2s"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                            = "1"

      [32m+[0m [0madmin_ssh_key {
          [32m+[0m [0m[1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
          [32m+[0m [0m[1m[0musername[0m[0m   = "kuhlmanlabs"
        }

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = "https://stdiagdeyzq2eastus.blob.core.windows.net/"
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-lvm-k8s-node-00-dev-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "UbuntuServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "Canonical"
          [32m+[0m [0m[1m[0msku[0m[0m       = "18.04-LTS"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m      = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m                   = "k8s-node-01-deea"
      [32m+[0m [0m[1m[0mdisable_password_authentication[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                        = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m                   = -1
      [32m+[0m [0m[1m[0mname[0m[0m                            = "lvm-k8s-node-01-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = [
          [32m+[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg--dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus",
        ]
      [32m+[0m [0m[1m[0mpriority[0m[0m                        = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                            = "Standard_B2s"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                            = "2"

      [32m+[0m [0madmin_ssh_key {
          [32m+[0m [0m[1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
          [32m+[0m [0m[1m[0musername[0m[0m   = "kuhlmanlabs"
        }

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = "https://stdiagdeyzq2eastus.blob.core.windows.net/"
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-lvm-k8s-node-01-dev-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "UbuntuServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "Canonical"
          [32m+[0m [0m[1m[0msku[0m[0m       = "18.04-LTS"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[0m[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: ./devtfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "./devtfplan"

```

</details>

*Pusher: @kuhlman-labs, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI/CD`*